<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"d251d0f5f68ac1e293c50d64c9e2a47109508a362e138d4965bcebc0562f98d8","plan_job_ref":"Job Pull Request Checks #3194 at https://github.com/GSA-TTS/FAC/actions/runs/9522924311","plan_out_hash":"f588523fd29dd4fc60050815528208a77c658716d84e5d07aa1cb2627e54a373","plan_hash":"473b072385b2c954821fd8c331c7552c429a802b31b75e603bf6f9a8ca3b5ee2","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 4 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
        id = "d79429a7-84f6-2576-fce2-e9479e71e48c"

+       policy {
+           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.cg-logshipper.cloudfoundry_app.cg_logshipper_app will be created
+   resource "cloudfoundry_app" "cg_logshipper_app" {
+       buildpack                       = (known after apply)
+       buildpacks                      = [
+           "https://github.com/cloudfoundry/apt-buildpack",
+           "nginx_buildpack",
        ]
+       disk_quota                      = 256
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "process"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 256
+       name                            = "logshipper"
+       path                            = "../shared/modules/cg-logshipper/logshipper.zip"
+       ports                           = (known after apply)
+       space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = "6c2d03a3-6eb2-4e4e-9bdb-b1a3b06fc5a8"
        }
+       service_binding {
+           service_instance = "39d698ad-03cb-4699-9c5a-cc83094d807e"
        }
+       service_binding {
+           service_instance = "3db5447d-8403-45c6-8b47-63ea899fd1cd"
        }
    }

  # module.staging.module.cg-logshipper.cloudfoundry_route.logshipper will be created
+   resource "cloudfoundry_route" "logshipper" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "fac-staging-logshipper"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "staging"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
!~      enable_ssh                      = true -> (known after apply)
+       health_check_http_endpoint      = (known after apply)
!~      health_check_invocation_timeout = 0 -> (known after apply)
!~      health_check_timeout            = 0 -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      id_bg                           = "************************************" -> (known after apply)
-       labels                          = {} -> null
        name                            = "fac-av-staging-fs"
!~      ports                           = [] -> (known after apply)
!~      space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" # forces replacement -> (known after apply) # forces replacement
+       stack                           = (known after apply)
#        (9 unchanged attributes hidden)

-       routes {
-           port  = 0 -> null
-           route = "3b0d1c3a-1535-4d92-982f-0d2776813152" -> null
        }
+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav_routing" {
        id = "a79420b0-0919-281d-cee8-8818ccf9dede"

-       policy {
-           destination_app = "28008a8e-f85b-4320-aedf-8522a2371bec" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "e4cb13f2-3e3f-4b19-a1d2-076ebfd1fd7a" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_route.clamav_route must be replaced
-/+ resource "cloudfoundry_route" "clamav_route" {
!~      domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b" # forces replacement -> (known after apply) # forces replacement
!~      endpoint = "fac-av-staging-fs.apps.internal" -> (known after apply)
!~      id       = "************************************" -> (known after apply)
+       port     = (known after apply)
!~      space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807" # forces replacement -> (known after apply) # forces replacement
#        (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.staging.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/staging.cg-logshipper.s3-logshipper-storage/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 4 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3194](https://github.com/GSA-TTS/FAC/actions/runs/9522924311)